'''
集合set
集合与之前列表、元组类似，可以存储多个数据，但是这些数据是不重复的
集合对象还⽀持union(联合), intersection(交), difference(差)和
sysmmetric_difference(对称差集)等数学运算.
'''
>>> x = set('abcd')
>>> x
{'c', 'a', 'b', 'd'}
>>> type(x)
<class 'set'>
>>>
>>>
>>> y = set(['h','e','l','l','o'])
>>> y
{'h', 'e', 'o', 'l'}
>>>
>>>
>>> z = set('spam')
>>> z
{'s', 'a', 'm', 'p'}
>>>
>>>
>>> y&z #交集
set()
>>>
>>>
>>> x&z #交集
{'a'}
>>>
>>>
>>> x|y #并集
{'a', 'e', 'd', 'l', 'c', 'h', 'o', 'b'}
>>>
>>> x-y #差集(x中减去与y共同的部分)
{'c', 'a', 'b', 'd'}
>>>
>>>
>>> x^z #对称差集(在x或z中，但不会同时出现在⼆者中)
{'m', 'd', 's', 'c', 'b', 'p'}
>>>
>>>
>>> len(x)
4
>>> len(y)
4
>>> len(z)
4